[{"title":"Statement of Faith","body_content":"## We Are...\n\n**A Christ Centered Church…** A person, Jesus Christ, not a program, is the foremost. \"Believe on the Lord Jesus Christ and thou shalt be saved.\" (Acts 16:31)\n\n**A Bible Believing Church…** We stand for the historic fundamentals of Biblical Christianity. We believe the Holy Scriptures of the Old Testament and New Testaments to be the verbally inspired Word of God, the final authority for faith and life. We hold the King James Version of the scriptures to be God's Word for English speaking people.\n\n**An Independent Church…** As a self-governing church we have no synod, conference, presbytery or other form form of human organization that exercises control over the local congregation.\n\n**An Evangelistic Church…** We maintain steadily expanding program of missions, seeking to bring all to the Savior.\n\n**A Fellowshipping Church…** Christian love, harmony, and unity are found in all our activities.\n\n  \n\n## God's Clear Plan for Salvation…\n\n**We all have sinned...** Romans 3:23 *\"For all have sinned, and come short of the glory (perfect standard) of God.\"*\n\n**The penalty for sin is death...** Romans 6:23 *\"For the wages (payment) for sin is death (Hell).”*\n\n**Jesus Christ died for our sins...** Romans 5:8 *\"But God commendeth (proved) His love toward us, in that, while we were yet sinners, Christ died for us.\"*\n\n**Believing that Christ’s death paid for our sin debt, we have eternal life (Heaven)...** Ephesians 2:8-9 *\"For by grace are ye saved through faith; and that not of yourselves: it is the gift of God. Not of Works...\"*\n\n \n\n## What We Believe\n\n* Verbal Inspiration of the Bible\n* Trinity of the Godhead\n* Judgment\n* Genesis Account of Creation\n* Original Sin\n* The Virgin Birth\n* The Blood Atonement\n* The New Birth\n* Justification by Faith\n* Local Church Government\n* Baptism by Immersion\n* Commemorative Lord's Supper\n* Security of the Believer\n* Resurrection of the Body\n* Pre-Millenial Return of Christ\n* Millenial Reign of Christ\n* Hell-Eternal Torment\n* Heaven-Eternal Glory\n* Personality of Satan\n\n## More detail taken from our Constitution...\n\n1.  We believe that the Bible is the verbally inspired Word of God, His revelation to man, inerrant in its original writing, therefore the final and supreme authority in faith and life.*(II Timothy 3:16-I7)*\n\n2.   We believe in one God, eternally existing in three persons, Father, Son, and Holy Spirit. *(Matthew 28:19)*\n\n3.   We believe that Jesus Christ was begotten by the Holy Spirit, born of the Virgin Mary, and that in His incarnation is true God and true Man, that He died for our sins, arose bodily from the dead, ascended into heaven; and as High Priest, is our Divine Advocate with the Father.   *(John 1:1-19; I Timothy 3:16; I Thessalonians 1:10)*                                                                                       \n\n4.   We believe in the Blessed Hope, the personal, premillennial, and imminent return of our Lord and Savior, Jesus Christ.  *(I Thessalonians 4:13-18; Titus 2:11-14)*\n\n5.  (a) We believe that the Holy Spirit is a Person who convicts the world of sin, of righteousness, and of judgment; and that He is the supernatural agent in regeneration, baptizing all believers into the body of Christ, indwelling and sealing  them  unto the day of redemption. *(John 16:8-11;  II Corinthians 3:6;*\n*I Corinthians 12:12-14; Romans 8:9; Ephesians 1:13-14)*\n\n(b) We  believe that He is  the divine  teacher who guides believers into all truth; and, that it is the privilege  and  duty of all the saved to be filled with the Spirit.*(John 16:13; I John 2:20. 27; Ephesians 5:18)*\n\n6.   We  believe that  man was created in  the image of God; that  he sinned and thereby incurred, not physical death, but also spiritual death, which is separation from God; and that all human beings are born with a sinful  nature, and are totally depraved, and that they  must be born again  to be accepted of God.  *(Romans 5:12; Romans 3:10-20; John 3:1-21)*\n\n7.   We believe that the Lord Jesus died for our sins according to the Scriptures, as a representative and substitutionary sacrifice, and that all who believe in Him are justified by faith; are regenerated by the Holy Spirit, and thereby become the children of God; that salvation is received by grace through faith in the shed blood of Christ who was crucified in our stead, that as a result we are made members of the body of Christ, which is the true church. *(I Corinthians 15:1-4; Hebrews 9:22; Acts 2:37-47)*\n\n8.  We believe that water baptism and the Lord's Supper are the only sacraments and ordinances of the church and that they are a Scriptural means of testimony for the church in this age.   Baptism has no saving merit, but after one believes and is saved, baptism is the next step to show  to the world that  he is now  identified  with Christ, who died, was  buried,  and  rose  again.    Whereas baptism is observed once, and is a sign of identification, and a testimony to newness of life, the Lord's Supper is commemorative and is to be observed often as a memorial to the broken body and shed blood of our Lord Jesus Christ.  *(Romans 6:4; Colossians 2:9-13; I Corinthians 11:26)*\n\n 9.  We believe that the Scriptures clearly teach non-conformity to the world for every believer; that it is incumbent  upon believers to live lives of separation from all worldly and sinful  practices; that violation of this teaching  involves the loss of joy, peace, and Christian  testimony to the world; that it incurs \"the  chastening of the Lord\"- and that non-conformity can be maintained only by constant  abiding  in Christ,  in a life of private and public Bible study,  meditation, prayer, and worship; that the world will not learn of the love wherewith Christ hath loved us, unless believers are willing to be exhibitors of that love. *(II Corinthians 6:14-18; II Corinthians 7:1; John 15:1-27; I John 1-5:21)*\n\n10. We believe in the bodily resurrection of all men, the saved to eternal life and the unsaved to judgment  and everlasting punishment. *(I Thessalonians 4:16; I Corinthians 15:51-57; Revelation 20:15-15; Daniel 12:2; John 5:28, 29)*\n\n11. We believe in a Heaven and a Hell. Heaven is the place of eternal, conscious happiness  for all who accept by faith the merits of Christ's atoning sacrifice. Hell is the place of eternal, conscious punishment   for   all    who    reject Christ.   *(John 14:I-6; Philippians  3:20; Psalm  9:I7; II Thessalonians 1:7-9; Revelation 20:10-15)*\n\n12. We believe that Satan is a personal being, the prince of demons, the great enticer and deceiver, the god of this age, whose end is the lake of fire. *(II Corinthians 4:3-4; Revelation 20:10)*\n\n13. We believe that God has commanded that no intimate sexual activity be engaged in outside of a marriage between a man and a woman.  We believe that any form of homosexuality, lesbianism, bisexuality, bestiality, incest, fornication, adultery, and pornography are sinful perversions of God's gift of sex.  We believe that God disapproves of and forbids any attempt to alter one's gender by surgery or appearance. *(Genesis 2:24; Genesis 19:5, 13; Genesis 26:8-9; Leviticus 18:1-30; Romans 1:26-29; I Corinthians 5:1, 6:9; I Thessalonians 4:1-8; Hebrews 13:4)*\n\n14.  We believe that the only legitimate marriage is the joining of one man and one woman. *(Genesis 2:24; Romans 7:2; I Corinthians 7:10; Ephesians 5:22-23)*\n\n15. We believe that human life begins at conception and that the unborn child is a living human being. Abortion constitutes the unjustified, unexcused taking of unborn human life.  Abortion is murder.  We reject any teaching that abortions of pregnancies due to rape, incest, birth defects, gender selection, birth or population control, or the physical or mental wellbeing of the mother are acceptable. *(Job 3:16; Psalm 51:5; 139:14-16; Isaiah 44:24; 49:1, 5; Jeremiah 1:5; 20:15-18; Luke 1:44)*\n\nFor more doctrinal information or questions, please contact us...","published":true}]
