[{"title":"A Praise to God's Faithfulness (Lev 19:23-25) ","body_content":">  **Lev 19:23-25**: *\"And when ye shall come into the land, and shall have planted all manner of trees for food, then ye shall count the fruit thereof as uncircumcised: three years shall it be as uncircumcised unto you: it shall not be eaten of. But in the fourth year all the fruit thereof shall be holy to praise the LORD withal. And in the fifth year shall ye eat of the fruit thereof, that it may yield unto you the increase thereof: I am the LORD your God.\"*\n\nThe children of Israel were in preparation to enter into the Promised Land. They had recently been delivered from the slavery of Egypt, and were receiving God's commands for holy living, spiritual worship, and the workings of their government, at the base of Mount Sinai. In the midst of this giving of the Law, we can find an interesting decree.\n\nWhen Israel would go into the fertile land of Canaan, when they planted their trees, to eat the fruit thereof for nourishment, they had to wait, not only for the tree to grow to the point where it could bear fruit, but four full years into the tree's fruit-bearing stage. In other words, they had to watch the fruit of their labor spoil on the ground for three years. In the fourth year, they had to dedicate that fruit to the Lord and His work. Only in the fifth year of fruit-bearing, could they partake of the fruit that they, no doubt, worked hard to nourish and maintain. Why were they to do this? Simply because God said so.\n\nThat is lesson enough for us: God has His own reasons for giving His commands. He does not command us, so that we can have a discussion with Him, and work out a compromise. He does not care for our excuses or complaints. He simply decrees, and we are to obey. The Jews did not sit down with God at the base of Mount Sinai, to hash out what they thought the Law should be and say. Instead, God stood at the top of the Mount, in His holiness, and, as their Deliverer, King, and Creator, decreed what would be best for them! At this point, Israel had a choice, just like we do: to obey or ignore. As we would find, if we read through the remainder of the Pentateuch (Gen-Deut), if they obeyed, they were blessed, but, if they disobeyed, they were chastised.\n\nA second lesson from this passage would be: Living in obedience to God's Word requires patience and faithfulness. Imagine being told that, if you planted a pear, apple, orange, or some other sort of fruit tree, you had to wait five years into its fruit-bearing stage to partake of your labor! This takes faith (that the tree will bear fruit for five years), patience (to watch the fruit spoil on the ground for four years), and faithfulness (to care for a tree that long). If we do any sort of worthwhile work for the Lord, we can be assured that it will take time to mature and flourish. Certainly, we may see some fruit from the first, but maturity often comes after God sees that we are faithful and patient. \n\nWe live in a day that demands instant gratification. This simply means that, when we want something, we want it now! Young couples do not want to add new appliances to their home little-by-little, but want to go into debt to have them now! Families do not want to work their way up to owning a house or nice car, but want those things now! We go to McDonald's, Burger King, and the like, because we want our food now! We order movies on demand and have Netflix accounts, because we want to watch our TV and movies instantly! You get the idea. \n\nWhen believers are told that the Christian life is a journey of walking with Jesus their entire lives, and that the fruit of the Spirit takes time to be brought forth, many balk at it, because they want to know Jesus Christ now. Let me ask you, if you are married, did you instantly get to know your spouse, or did it take time? Whoever has a good friend, did they become good friends instantly with you, or did it take time? We believe that our belief system is not about religion, but a relationship with Jesus Christ! Any good, solid, trusting relationship takes time and effort to cultivate. What have you done to cultivate your relationship with Christ today? Are you in His Word? Have you prayed? When did you last attend a church service? When did you last tell someone about Christ? All of these are vital to growing our relationship with Him.\n\nNow, I titled this \"little\" article what I did for a reason, but had to get the preliminaries out of the way first. For the past five years, my family and I had been working to restart a church, in the Frederick, MD area. Restarting a church is very different than actually starting one. Starting a church is starting a new work, while restarting one is resurrecting an existing work. Both need God's help and blessing, but restarting a church has obstacles to overcome that starting one does not, but I digress.\n\nWe worked at sowing the seed of God's Word, discipling new/young believers, and ministering to the community in general, and did so for five years. However, for the first four, we saw very little obvious fruit. I read this passage in June 2015, and it was impressed upon my heart to ask God for fruit in the fifth year. We had been as faithful as we knew to be, and had been patient, by God's grace. The Lord had provided a roof for our heads, and took care of every need. While the work was fraught with spiritual warfare and, at times, very stressful and draining, how could we complain, while the Lord provided? And so, trusting in God's Word, and taking the knowledge that we were in God's will, we pressed on: again, by God's grace.\n\nIt is now July 2016. In February, we were told by our bank that we were going to lose our property, either through sale or seizure. This was not our fault: it just simply was what it was. At that time, God stated, through prayer, counsel, and His Word, that we were done with the church restart. It was time to stop trying to resurrect a dead body. We had few faithful families, little fruit, the community rejected us, and were losing our home. Over the next several months, God would confirm this time and time again. Though we did not know where God would bring us next, we knew that He would provide, as always. How could He not? He had always taken care of us perfectly, as a testimony to His perfection and trustworthiness! During the weeks of March and April, the Lord opened the door for us to minister at Calvary Bible Church in Westminster (just 40 min away from where we lived). This established church lost their pastor on the day that we held our last service, and, to God's glory, Calvary Bible voted me in as their pastor, on May 29 of this year. \n\nPlease allow me to say that, it is the fifth year, and God has allowed us to partake of the fruit. My wife, children, and I are thrilled to be a part of the Calvary Bible family! What it means for us to be here is beyond description, and that is not an exaggeration. People ask, how it can be so, and I can only answer that God is faithful and, as many pastors have told me over the last several months, He blesses faithfulness. Folks, please make no doubt, this is not a testament to glorify me, my family, or this church: it is one that glorifies God, and Him alone! Without our Father in Heaven, we would have no hope, no help, no promises, and no blessings. He alone deserves the glory for all the good that He has done for us.\n\nMaybe you have been working on something for the Lord for awhile now, and have seen little fruit. I cannot guarantee that you will see all that you want to see come to fruition in the fifth year, but I can say for certain that God blesses faithfulness. Whatever He has called you to do, if it lines up solidly with His Word, continue doing it with all your might, for His glory. You may never see the fruit that you want in this life, but, rest assured, reward is waiting for you in Heaven. We must do what God wants us to do for His name and His glory. We cannot do it for earthly gain, accolades, or prominence. Instead, we must give our God the glory that He deserves. \n\nI encourage you to read your Bible for a few minutes today. Start in the books of John and Romans, if you do not know where to start. Ask God to fill you with His Spirit, and speak to you, if you are His child. When He does, write it down, and determine to apply it. If you do not know how to do any of these things, or if you are struggling and need encouraged, please contact me, I would be happy to help you develop your relationship with the God of Heaven, and pray with you. - God Bless, Pastor Bussard","categories":["Articles"],"author":["recKHTg3IcSyY3pS2"],"date_added":"2016-07-19","published":true,"author_name":["Pastor James Bussard"]}]
