[{"Instructions":"This is a single line base.  Just use these this row.","Content":"The question is this: **“If you were to die today, are you 100% certain that Heaven is your home?”** Many people do not know this, or hope that they are going. Many are trusting in their church, family, or personal beliefs to take them to Heaven. Friend, the only way to obtain eternal life is defined by God in His Word: the Bible; all other ways lead to the road of destruction *(Matthew 7:13-14)*\n\n### 1. Know That God Loves You *(John 3:16)*\n\nThe truth is that God does love everyone, and has exhibited this in many ways:\n\nThe first way is that **God gave us life**. Genesis chapter 1-2 tell the true story of Creation, and that an eternal, all-powerful God created the universe and all that exists therein. This passage tells us that mankind did not evolve by chance, but was created in the image of the Creator God. It furthermore tells us that we were created for the purpose of pleasing God. In truth, Adam and Eve, the first humans, knew God as their friend, before they disobeyed His commands and fell into sinful rebellion. Friend, maybe you feel that you have no purpose in life. The truth is that God gives us purpose and revels such through the Bible *(Revelation 4:11)*!\n\nThe second way is that **God gave us His Word**. The Bible is the inspired *(II Timothy 3:16)*, preserved *(Psalm 12:6-7)* Word of God. It is a compilation of sixty-six books that was written over a period of about 1500 years, by thirty different writers, in three different languages, and yet has one cohesive train of though. These writers did not have much, if any, collusion or contact, and yet God allowed this Book to be perfect, without contradiction or variance. Men have tried to disprove the Bible, but have only succeeded in proving it to be the very Word of God! That we have the Bible means that we have God's message to us that tells us who we are, where we came from, who God is, how we can obtain eternal life, and much, much more. It is God's love letter to Man, the foundation for our belief, and our handbook for living.\n\nIf God did not love us, He would not have created us with the purpose of knowing, and pleasing Him, nor would He have given us His Word!\n\n### 2. Agree That Every Person is a Sinner *(Romans 3:10-23)*\n\nWould you say that you are a sinner? Have you ever been guilty of wrongdoing in your life? God says that all men are sinners and have broken His Law. None needs to be taught to sin; we are simply born with a sin nature. I have three children, and never had to sit down with them to explain how to lie, steal, or commit other sins, neither did you. We may be moral and generally good, but one sin makes us a sinner in the eyes of God *(James 2:10)*. God's Law is primarily made up of, what we call, the Ten Commandments. They are found in Exodus 20. If we were to go through this list, we would probably discover that we have broken one of God's laws. Oh, sure, we probably have not committed murder or adultery, but all of us have borne false witness (which is lying), stolen something, and/or dishonored our parents. Humanity puts one sin in front of another, and claims that some are \"not so bad\". God states that He hates all sin, and that one sin makes us a sinner: meaning that we have to be judged for breaking His Law.\n\n### 3. Agree That There Is a Penalty for Sin *(Romans 6:23)*\n\nImagine if I sped down your street going 70mph, in a 25mph zone, and the police pulled me over for speeding. You would agree that the police deserve to do it, because I have broken the law, and need to pay the fine. Every person has broken God’s Law, and can expect to pay the consequences of sin one day. We understand that we are all dying physically, but did you know that there is a place God created where all sinners go to die spiritually? This place is called Hell. Hell is a real place! It is not Earth, or imaginary, but a place of fire, judgment, weeping, and gnashing of teeth forever and ever. *(Luke 16:19-31)* Jesus preached more on Hell than Heaven, and explained that God created it for Satan, not humanity *(Matthew 25:41)*. However, just as Satan sinned against God, he tempted Man to do the same and we fell for it! Therefore, God has no choice but to give every sinner the same penalty for sin: Hell!\n\n### 4. Agree That Jesus Christ Paid Your Sin Debt *(Romans 5:8)*\n\nThis comes back to God’s love for us. God wants every person to go to Heaven and be with Him, but something had to be done with our sin! The only way for sin to be done away with is if God somehow takes it away; this is what Jesus did for us. Jesus Christ is God, and yet He shed His glory, to become a humble man *(Philippians 2:5-8)*. Jesus lived a perfect life, and suffered everything that we suffer, on Earth, but wicked men put Him on a cross out of envy. On that cross, Christ bore 100% of the sins of the whole world (present, past, and future). When He cried, “My God! My God! Why hast thou forsaken me?” God the Father had turned His back on God the Son, as He suffered our Hell for us! Jesus then died, was buried, and rose bodily from the grave three days later! Jesus’ Resurrection signifies His victory over Death and Hell, and the Father’s acceptance of His payment for our sins *(Romans 3:23-26)*!\n\n### 5. Agree That You Must Personally Accept Jesus As Your Savior *(Romans 10:13; Acts 16:31)*\n\nGod states that the only thing a person must do to be saved from sin is simply believe in the Person and Work of Jesus Christ. We must believe that Christ is who He says that He is, otherwise, He could not have done what the Bible says that He did! The two are inseparable! If Christ was not God, then His work on the cross did us no good. However, if Christ was God in the flesh, then He truly is the Messiah: the Savior from sins!\n\nIf you would like eternal life you be yours, all the Bible states that you must do is believe. Believing means to accept the gift of eternal life by putting your full faith in the quality of Christ and His work. Jesus stated that He is the Way, Truth, and Life, and that no one can come to the Father, except through Him (John 14:6). All we have to do is believe this to be true! If you choose to believe, you can exercise this belief by calling upon the Lord in prayer: telling Jesus that He is enough for your salvation, and that you trust Him to take you to Heaven when you die. The action of prayer does not save, as no religious action or expression can, but the belief expressed through your mouth in prayer does *(Romans 10:9-10)*.\n\nSo what about it, Friend? Is Jesus enough to take you to Heaven, or do you feel the need to help Him still? *(Ephesians 2:8-9)*\n\nDid He pay for all of your sins on the cross, or just some of them? *(Hebrews 10:11-12)*\n\nIs there any day where we can live life good enough for God to accept us? *(Isaiah 64:6)*\n\nCan religion save? A church? A family? A denomination? *(John 14:6)*\n\nTo profess your faith in Jesus Christ as your Savior, and prove the belief in your heart, simply pray a prayer like this one by faith:\n\n*Dear God,*\n\n*I know that I am a sinner. I know that I have offended you and your Law, and deserve to pay the penalty for this, which is eternal death, in Hell.* \n \n*I believe that Jesus Christ is God in the flesh. I believe that He died, was buried, and rose again, to save me from my sins. I believe that Christ fully paid my sin debt for me. The best that I know how, I accept the free gift of eternal life, through Jesus Christ, so that I can have my sin forgiven and be saved. Please help me to live for you, to prove my belief in you before others.* \n \n*Thank you, God.*\n\nFriend, if you prayed that prayer just now, please let us know, that we might encourage and help you develop a relationship with the Lord Jesus Christ through His Word!\nOr, if you still have some doubts, please let us help you!\n\n**The greatest thing that you will ever know is whether or not you will go to Heaven when you die. This decision lasts forever!**\n\nIf you have any questions, or comments, please email Pastor Bussard at CalvaryBibleMDPastor@Gmail.com, or call him at (410) 848-1848.","Featured_Image":[{"id":"attDfDloIvnb5Cf9o","url":"https://dl.airtable.com/iTdL8YsT6SW8v1pcNML2_Gospel.png","filename":"Gospel.png","size":1948345,"type":"image/png","thumbnails":{"small":{"url":"https://dl.airtable.com/bbkordVzTV6ZNMaQzrIh_small_Gospel.png","width":64,"height":36},"large":{"url":"https://dl.airtable.com/M8r1qjFjQZ22ZpGhjiCZ_large_Gospel.png","width":512,"height":512}}}],"Heading":"Am I Going To Heaven?"}]
