[{"Section_title":"What to Expect","Content":"It does make a difference what you believe. This is the theme of Hartwell Baptist Church.  What you believe about something defines your actions and reactions to the events of life. What you believe about certain foods determines what you eat.  What you believe about politics determines who you vote for or against.  But, what you believe about the Bible casts a light about every area of life.\n\n\nWe would like to answer a few questions that you might have, to help make your first visit easier:"},{"Section_title":"What time are your services?","Content":"At Calvary Bible Church we offer 3 services on Sunday. At 9:30 am, we have Sunday School classes for adults and children of all ages. At 10:45am, we have our main Sunday Morning service. Our Sunday Evening service is at 6pm. Our Wednesday Bible Study is at 7 pm, with youth group at the same time. Childcare and Nursery are provided for all services, so bring the kids! Pagers are provided for your peace of mind."},{"Section_title":"What sort of music do you use, in your services?","Content":"We are blessed to have several musically inclined individuals that enjoy serving the Lord through the music ministry. We believe in using conservative, God-honoring hymns and spiritual songs, while avoiding contemporary music and beats that do not emphasize, nor honor, the Lord Jesus Christ."},{"Section_title":"What sort of preaching do you have, in your services?","Content":"We primarily use expository preaching in our services: taking the Bible and preaching verse-by-verse, so that a direct application can be made. Occasionally, we will have topical preaching or character studies that are always soaked in the scriptures. The pastor and teachers do not have an agenda, other than Christ, and do not emphasize politics from the pulpit."},{"Section_title":"What sort of doctrine do you hold to?","Content":"We hold simply to the Bible. We do not hold to any form of Calvinism or Arminianism. We are not part of any councils, fellowships, synods, or otherwise. We do not give preference or persecution based upon college, church background, personal history, or otherwise. We are not ecumenical or neo-evangelical. We simply believe in holding to the doctrine of Jesus Christ, as put forth in God's Word: fellowshipping with those that love the Truth, and avoiding those that do not."},{"Section_title":"What are your nursery ages?","Content":"Our nursery ages range from 0-3 years of age. We provide a nursery for all services."},{"Section_title":"Do you have services for children?","Content":"During the Sunday School hour, Calvary has an exciting Children’s ministry where your kids will be taught the Bible in age-appropriate classes. During the morning service, we offer a Jr. Church program for ages 4 through 5th grade. Nursery is available for children 0-3, and pagers are available."},{"Section_title":"About how long are your services?","Content":"Our services last about 60 to 90 minutes, depending on the day, and contain music, prayer, and teaching from the Bible that will apply directly to your life."},{"Section_title":"Is there a dress code?","Content":"We do not have a dress code, nor do we judge folks by their attire. The pastor and church leaders will be dressed in business attire (suit and tie), but we encourage everyone else to dress in clothes that are comfortable for them. We simply encourage everyone to give God their best with what they have.  Our main goal is that you feel welcome during your visit with us."},{"Section_title":"Will I be singled out if I’m new?","Content":"Absolutely not. You are our guest. Each Sunday, there are people just like you who are attending Calvary Bible for the first time. Our goal is for you to have the best experience possible."}]
